# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\ADMH2\Documents\PSoC Creator\P6\P6_1.cydsn\P6_1.cyprj
# Date: Mon, 27 Nov 2023 06:33:14 GMT
#set_units -time ns
create_clock -name {CyXTAL_32kHz} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/clk_32k_xtal}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 15 31} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {LED_Driver_1_ClkInternal} -source [get_pins {ClockBlock/clk_sync}] -edges {1 117 235} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 533205 1066407} -nominal_period 22216796.875 [list [get_pins {ClockBlock/dclk_glb_3}]]

set_false_path -from [get_pins {__ZERO__/q}]

# Component constraints for C:\Users\ADMH2\Documents\PSoC Creator\P6\P6_1.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\ADMH2\Documents\PSoC Creator\P6\P6_1.cydsn\P6_1.cyprj
# Date: Mon, 27 Nov 2023 06:33:06 GMT
